# ApplicationClosingEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationClosingEventArgs Properties
ApplicationClosingEventArgs Class See Also
---
The ApplicationClosingEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |

# See Also
ApplicationClosingEventArgs Class
Autodesk.Revit.UI.Events Namespace